EJERCICIOS DATAFRAME:
CARGAREMOS EL FICHERO TITANIC SCV Y RESOLVEREMOS LOS SIGUIENTES ENUNCIADOS:
1- VER LOS 6 PRIMERO NOMBRES DE LOS PASAJEROS DE LA CLASE 1(DESC)
2- VER LAS 3 ÚLTIMAS EDADES DE LOS PASAJEROS DE LA CLASE 3
3- VER LOS 4 PRIMEROS NOMBRES DE LOS PASAJEROS QUE NO SEAN DE LA CLASE 2
4- VER LOS 6 PRIMEROS PASAJEROS CUYO NOMBRE CONTIENE LA PALABRA MARY
5- VER LOS 10 PRIMEROS NOMBRES DE LOS PASAJEROS QUE SOBREVIVIERON(SURVIVED = 0, SURVIVED =1)

In [43]:
import pandas as pd

titanic= pd.read_csv(r"C:\Users\Laura Fort\Documents\Python\introductionPython\Titanic.csv")
titanic
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    object
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    object
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: int64(5), object(7)
memory usage: 83.7+ KB

In [44]:
#1- VER LOS 6 PRIMERO NOMBRES DE LOS PASAJEROS DE LA CLASE 1(DESC)
filtro1= titanic["Pclass"]==1
titanic6NombresC1= titanic[filtro1]
titanic6NombresC1= titanic6NombresC1["Name"].head(6).sort_values(ascending=False)
print(titanic6NombresC1)

#opciones directas por no tener que crear una nueva variable:
titanic[filtro1]["Name"].head(6).sort_values(ascending=False)
titanic[filtro1].Name.head(6).sort_values(ascending=False)
titanic["Name"][filtro1].head(6).sort_values(ascending=False)

#para ver más de un campo
titanic[["Name","Age"]]

23                         Sloper, Mr. William Thompson
6                               McCarthy, Mr. Timothy J
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
27                       Fortune, Mr. Charles Alexander
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
11                             Bonnell, Miss. Elizabeth
Name: Name, dtype: object

                                                  Name  Age
0                                Pepe, Mr. Owen Harris   22
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   38
2                               Heikkinen, Miss. Laina   26
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   35
4                             Allen, Mr. William Henry   35
..                                                 ...  ...
886                              Montvila, Rev. Juozas   27
887                       Graham, Miss. Margaret Edith   19
888           Johnston, Miss. Catherine Helen "Carrie"  NaN
889                              Behr, Mr. Karl Howell   26
890                                Dooley, Mr. Patrick   32

[891 rows x 2 columns]

In [45]:
#2- VER LAS 3 ÚLTIMAS EDADES DE LOS PASAJEROS DE LA CLASE 3
filtro2= titanic["Pclass"]==3
titanic3EdadesC3= titanic[filtro2]
titanic3EdadesC3= titanic3EdadesC3["Age"].tail(3)
titanic3EdadesC3
#método más corto:
titanic[filtro2]["Age"].tail(3)

885     39
888    NaN
890     32
Name: Age, dtype: object

In [46]:
#3- VER LOS 4 PRIMEROS NOMBRES DE LOS PASAJEROS QUE NO SEAN DE LA CLASE 2
filtro3= titanic["Pclass"]!=2
titanic4NombresNoC2= titanic[filtro3]
titanic4NombresNoC2= titanic4NombresNoC2["Name"].head(4)
titanic4NombresNoC2

#método más corto
titanic[filtro3]["Name"].head(4)

0                                Pepe, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
Name: Name, dtype: object

In [47]:
#4- VER LOS 6 PRIMEROS PASAJEROS CUYO NOMBRE CONTIENE LA PALABRA MARY
titanicMary= titanic["Name"].str.contains("Mary")
titanic[titanicMary].head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55,0,0,248706,16,NaN,S
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,"7,75",NaN,Q
318,319,1,1,"Wick, Miss. Mary Natalie",female,31,0,2,36928,"164,8667",C7,S
322,323,1,2,"Slayter, Miss. Hilda Mary",female,30,0,0,234818,"12,35",NaN,Q
347,348,1,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,NaN,1,0,386525,"16,1",NaN,S
358,359,1,3,"McGovern, Miss. Mary",female,NaN,0,0,330931,"7,8792",NaN,Q

In [48]:
#5- VER LOS 10 PRIMEROS NOMBRES DE LOS PASAJEROS QUE SOBREVIVIERON(SURVIVED = 0, SURVIVED =1)
filtro5= titanic["Survived"]==1
titanicSurvived= titanic[filtro5]["Name"].head(10)
titanicSurvived

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
11                             Bonnell, Miss. Elizabeth
15                     Hewlett, Mrs. (Mary D Kingcome)
17                         Williams, Mr. Charles Eugene
19                              Masselmani, Mrs. Fatima
Name: Name, dtype: object

In [49]:
#COMO SABER EL NÚMERO DE PERSONAS DE LA CLASE 1

numPasajeros= titanic[filtro1].PassengerId.count()
print("El número de pasajeros de clase 1 es:", numPasajeros)

El número de pasajeros de clase 1 es: 216

In [50]:
#Como aplicar más de una condición a un filtro, para ello usaremos los operadores de lógica OR + AND
#En el caso del OR= | (altgr+1) y en AND= &

titanicC3C1= (titanic["Pclass"]==3)|(titanic["Survived"]==1)
titanic[titanicC3C1].PassengerId.count()

np.int64(714)

In [51]:
titanicC2PS= (titanic["Pclass"]==2)&(titanic["Survived"]==1)
titanic[titanicC2PS].PassengerId

9       10
15      16
17      18
21      22
43      44
      ...
831    832
865    866
866    867
874    875
880    881
Name: PassengerId, Length: 87, dtype: int64

In [52]:
#Ver lsos diferentes valores de un campo, usaremos Unique
titanic["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

PRÁCTICA 6: VER LA CANTIDAD DE PASAJEROS QUE SON HOMBRES DE LA CLASE 1 Y QUE EMBARCARON POR LA PUERTA S
PRÁCTICA 11: VER LOS NOMBRES DE LOS PASAJEROS DE LA CLASE 3 QUE NO SOBREVIVIERON
PRÁCTICA 12: VER LOS 12 ÚLTIMOS NOMBRES EN ORDEN DESC DE PASAJEROS QUE SON MUJERES DE LA CLASE 3 Y QUE, CUYO PASSENGERID ES MAYOR A 100
PRÁCTICA 13: VER UNA LISTA CON LOS NOMBRES CUYO PASSENGERId ESTÉ COMPRENDIDO ENTRE 70 Y 180

In [53]:
#PRÁCTICA 6: VER LA CANTIDAD DE PASAJEROS QUE SON HOMBRES DE LA CLASE 1 Y QUE EMBARCARON POR LA PUERTA S
titanicC1ManNoPS= (titanic["Pclass"]==1)&(titanic["Sex"]=="male")&(titanic["Embarked"]=="S")
titanic[titanicC1ManNoPS].PassengerId.count()

np.int64(79)

In [60]:
#PRÁCTICA 11: VER LOS NOMBRES DE LOS PASAJEROS DE LA CLASE 3 QUE NO SOBREVIVIERON
titanicC3NoSurvived= (titanic["Pclass"]==3)&(titanic["Survived"]==0)
titanic[titanicC3NoSurvived].Name.sort_values()

845                               Abbing, Mr. Anthony
746                       Abbott, Mr. Rossmore Edward
365                    Adahl, Mr. Mauritz Nils Martin
401                                   Adams, Mr. John
40     Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
                            ...
240                             Zabour, Miss. Thamine
422                                Zimmerman, Mr. Leo
282                         de Pelsmaeker, Mr. Alfons
153                   van Billiard, Mr. Austin Blyler
868                       van Melkebeke, Mr. Philemon
Name: Name, Length: 372, dtype: object

In [62]:
#PRÁCTICA 12: VER LOS 12 ÚLTIMOS NOMBRES EN ORDEN DESC DE PASAJEROS QUE SON MUJERES DE LA CLASE 3 Y QUE, CUYO PASSENGERID ES MAYOR A 100
titanicC3FemaleID100= (titanic["Pclass"]==3)&(titanic["Sex"]=="female")&(titanic["PassengerId"]>100)
titanic[titanicC3FemaleID100]["Name"].tail(12).sort_values(ascending=False)

830     Yasbeck, Mrs. Antoni (Selini Alexander)
863           Sage, Miss. Dorothy Edith "Dolly"
885        Rice, Mrs. William (Margaret Norton)
875            Najib, Miss. Adele Kiamie "Jane"
823                          Moor, Mrs. (Beila)
888    Johnston, Miss. Catherine Helen "Carrie"
816                Heininen, Miss. Wendla Maria
882                Dahlberg, Miss. Gerda Ulrika
852                     Boulos, Miss. Nourelain
858       Baclini, Mrs. Solomon (Latifa Qurban)
813          Andersson, Miss. Ebba Iris Alfrida
855                  Aks, Mrs. Sam (Leah Rosen)
Name: Name, dtype: object

In [56]:
#PRÁCTICA 13: VER UNA LISTA CON LOS NOMBRES CUYO PASSENGERId ESTÉ COMPRENDIDO ENTRE 70 Y 180

titanicID70and100= (titanic["PassengerId"]>=70)&(titanic["PassengerId"]<=100)
titanic[titanicID70and100].Name

69                                    Kink, Mr. Vincenz
70                           Jenkin, Mr. Stephen Curnow
71                           Goodwin, Miss. Lillian Amy
72                                 Hood, Mr. Ambrose Jr
73                          Chronopoulos, Mr. Apostolos
74                                        Bing, Mr. Lee
75                              Moen, Mr. Sigurd Hansen
76                                    Staneff, Mr. Ivan
77                             Moutal, Mr. Rahamin Haim
78                        Caldwell, Master. Alden Gates
79                             Dowdell, Miss. Elizabeth
80                                 Waelens, Mr. Achille
81                          Sheerlinck, Mr. Jan Baptist
82                       McDermott, Miss. Brigdet Delia
83                              Carrau, Mr. Francisco M
84                                  Ilett, Miss. Bertha
85    Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...
86                               Ford, Mr. William Neal
87                        Slocovski, Mr. Selman Francis
88                           Fortune, Miss. Mabel Helen
89                               Celotti, Mr. Francesco
90                                 Christmann, Mr. Emil
91                           Andreasson, Mr. Paul Edvin
92                          Chaffee, Mr. Herbert Fuller
93                              Dean, Mr. Bertram Frank
94                                    Coxon, Mr. Daniel
95                          Shorney, Mr. Charles Joseph
96                            Goldschmidt, Mr. George B
97                      Greenfield, Mr. William Bertram
98                 Doling, Mrs. John T (Ada Julia Bone)
99                                    Kantor, Mr. Sinai
Name: Name, dtype: object